anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
void drawEllipses(void)
{
    uint32_t before, after;
    
    before = millis();
        
    ellipse(XC - 128, YC - 192, XC + 128, YC + 192, ILI9486_GREEN);

    after = millis();

    ellipse(XC - 128, YC - 160, XC + 128, YC + 160, ILI9486_YELLOW);
    ellipse(XC - 128, YC - 128, XC + 128, YC + 128, ILI9486_BLUE);
    ellipse(XC - 128, YC -  96, XC + 128, YC +  96, ILI9486_RED);

    printf("\n%dx%d ellipse took %dms\n", 256, 384, after - before);
}


/* drawCircles --- draw circles */

void drawCircles(void)
{
    uint32_t before, after;
    
    before = millis();
        
    circle(XC, YC, 128, ILI9486_BLACK);

    after = millis();
    printf("\n%d radius circle took %dms\n", 128, after - before);
}


/* drawLines --- draw lines radiating from centre */

void drawLines(void)
{
    uint32_t before, after;
    uint16_t x[256], y[256];
    int i;
    
    for (i = 0; i < 256; i++)
    {
        const double theta = ((2.0 * M_PI) / 256.0) * (double)i;

        x[i] = (int)((128.0 * cos(theta)) + 0.5) + XC;
        y[i] = (int)((128.0 * sin(theta)) + 0.5) + YC;
    }
    
    before = millis();
        
    for (i = 0; i < 256; i++)
    {
        setLine(XC, YC, x[i], y[i], ILI9486_WHITE); // hsvto565(i, MAXPRI, MAXPRI));
    }

    after = millis();
    printf("\n%d lines took %dms\n", 256, after - before);
}


/* drawRandomNoise --- fill a framebuffer with random pixels and copy to display */

void drawRandomNoise(void)
{
    uint32_t end;
    iliColr pixels[MAXPRI + 1];
    int x, y;
    
    // Precompute saturated colours because hsvto565 is way too slow to call for entire buffer
    for (y = 0; y < MAXPRI + 1; y++)
    {
        pixels[y] = hsvto565(y, MAXPRI, MAXPRI);
    }
    
    end = millis() + 500;
    
    while (millis() < end)
    {
        for (y = 0; y < FB_HT; y++)
        {
            for (x = 0; x < FB_WD; x++)
            {
                FrameBuffer[y][x] = pixels[(rand() >> 7) & 255];
            }
        }
        
        ili9486_pixMap((MAXX - FB_WD) / 2, (MAXY - FB_HT) / 2, FB_WD, FB_HT, (const uint16_t *)FrameBuffer);
    }
}


/* initMCU --- set up the microcontroller in general */

void initMCU(void)
{
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
}


/* initGPIOs --- set up the GPIO pins */

static void initGPIOs(void)
{
    TRISAbits.TRISA7 = 0;   // RA7 pin 92, P3 pin 42 as output (timer toggle)
    TRISBbits.TRISB9 = 0;   // RB9 pin 33, P2 pin 33 as output (LED)
}


/* initMillisecondTimer --- set up a timer to interrupt every millisecond */

void initMillisecondTimer(void)
{
    /* Configure Timer 1 for 1kHz/1ms interrupts */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = (FPBCLK / 1000) - 1;  // Interrupt every millisecond (1kHz)
    
    IPC1bits.T1IP = 7;          // Timer 1 interrupt priority 7 (highest)
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    T1CONSET = _T1CON_ON_MASK;  // Enable Timer 1
}


/* initUARTs --- set up UART(s) and buffers, and connect to 'stdout' */

static void initUARTs(void)
{
    const int baud = 9600;
    
    U3Buf.tx.head = 0;
    U3Buf.tx.tail = 0;
    U3Buf.rx.head = 0;
    U3Buf.rx.tail = 0;

    /* Configure PPS */
    RPC1Rbits.RPC1R = 1;    // U3Tx on pin 6, RPC1, P2 pin 6
    U3RXRbits.U3RXR = 10;   // U3Rx on pin 9, RPC4, P2 pin 9 (5V tolerant)
    
    U3MODEbits.UEN = 3;     // Use just Rx/Tx; no handshaking
    
    U3BRG = (FPBCLK / (baud * 16)) - 1;
    
    IPC9bits.U3IP = 1;          // UART3 interrupt priority 1 (lowest)
    IPC9bits.U3IS = 0;          // UART3 interrupt sub-priority 0
    
    IFS2CLR = _IFS2_U3TXIF_MASK;  // Clear UART3 Tx interrupt flag
    IFS1CLR = _IFS1_U3RXIF_MASK;  // Clear UART3 Rx interrupt flag
    IFS1CLR = _IFS1_U3EIF_MASK;   // Clear UART3 error interrupt flag
    
    IEC1SET = _IEC1_U3RXIE_MASK;  // Enable UART3 Rx interrupt
    IEC1SET = _IEC1_U3EIE_MASK;   // Enable UART3 error interrupt
    
    U3MODESET = _U3MODE_ON_MASK;      // Enable USART3
    U3STASET = _U3STA_UTXEN_MASK | _U3STA_URXEN_MASK; // Enable Rx and Tx
}


/* initPMP --- initialise the Parallel Master Port as a 16-bit Z80-style bus */

static void initPMP(void)
{
    PMMODEbits.MODE16 = 1;  // 16 data bit mode
    PMMODEbits.WAITB = 0;   // Setup time wait states
    PMMODEbits.WAITM = 0;   // Read/write strobe width
    PMMODEbits.WAITE = 0;   // Hold time wait states
    PMMODEbits.IRQM = 0;    // No interrupts
    PMMODEbits.INCM = 0;    // No auto-increment
    PMMODEbits.MODE = 2;    // /WR and /RD mode (Z80 style bus)
    
    PMCONbits.ADRMUX = 0;   // Non-multiplexed address bus
    PMCONbits.PTRDEN = 1;   // Enable the PMRD pin (pin 82, P3 pin 32)
    PMCONbits.PTWREN = 1;   // Enable the PMWR pin (pin 81, P3 pin 31)
    PMCONbits.RDSP = 0;     // PMRD active-LOW
    PMCONbits.WRSP = 0;     // PMWR active-LOW
    PMCONbits.CSF = 2;      // PMCS1 and PMCS2 are Chip Select pins
    PMCONbits.CS1P = 0;     // PMCS1 active-LOW
    PMCONbits.CS2P = 0;     // PMCS2 active-LOW
    
    PMAENbits.PTEN = 0x03 | (1 << 14) | (1 << 15);
    
    PMADDRbits.CS1 = 0;     // PMCS1 inactive (pin 71, P3 pin 21)
    PMADDRbits.CS2 = 0;     // PMCS2 inactive (pin 70, P3 pin 20)
    
    PMCONSET = _PMCON_ON_MASK; // Enable the Parallel Master Port module
}


void main(void)
{
    const int imgWd = 320;
    const int imgHt = 240;
    static uint16_t pixMap[64] = {0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000,  // black/white
                                  0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff}; // black/white
    
    initMCU();
    initGPIOs();
    initUARTs();
    initPMP();
    initMillisecondTimer();
    
    __builtin_enable_interrupts();     // Global interrupt enable
    
    puts("ILI9486TEST");
    
    ili9486_begin();
    
    generateGraticule(&LCDColours);
    
    while (1)
    {
        LED = 0;
        ili9486_fillRect(0, 0, MAXX - 1, MAXY - 1, ILI9486_WHITE);    // Clear the screen
        
        delayms(500);
               
        LED = 1;
        ili9486_pixMap(8, 8, 8, 8, pixMap);
        ili9486_pixMap((MAXX - imgWd) / 2, (MAXY - imgHt) / 2, imgWd, imgHt, (const uint16_t *)Sunflower);
        
        delayms(500);
        
        LED = 0;
        
        drawBoxes();
                
        delayms(500);
        
        LED = 1;

        drawGraduatedHues();
        
        delayms(500);
        
        if (PORTAbits.RA1 == 0)
        {
            fputs("PRESSED!", stdout);
        }
        else
        {
            printf("%X", 0xdeadbeef);
        }
        
        LED = 0;
        
        drawOscilloscopeDisplay();
        
        delayms(500);
        
        LED = 1;
        
        drawText();
        
        delayms(500);
        
        LED = 0;
        
        drawEllipses();
        
        delayms(500);
        
        LED = 1;
        
        drawCircles();
        
        delayms(500);
        
        LED = 0;
        
        drawLines();

        delayms(500);
        
        LED = 1;
        
        drawRandomNoise();
    }
}
